# Lab | SQL Joins on multiple tables

In this lab, you will be using the [Sakila](https://dev.mysql.com/doc/sakila/en/) database of movie rentals.

1. Write a query to display for each store its store ID, city, and country.

In [ ]:
'''
select 
	store.store_id,
    city.city,
    country.country
from 
	store
Inner join
	address
on
	store.address_id = address.address_id
Inner join
	city
on
	address.city_id = city.city_id
Inner join
	country
on
	city.country_id = country.country_id
    
Output:
# store_id, city, country
'1', 'Lethbridge', 'Canada'
'2', 'Woodridge', 'Australia'
'''

2. Write a query to display how much business, in dollars, each store brought in.

In [ ]:
'''
select 
   store.store_id,
   count(payment.amount) as "revenue in $"
from 
	store
Inner join
	staff
on
	store.store_id = staff.store_id
Inner join
	payment
on
	staff.staff_id = payment.staff_id
group by
	 store.store_id

Output:
# store_id, revenue in $
'1', '8057'
'2', '7992'
'''

3. What is the average running time of films by category?

In [ ]:
'''
select 
	category.name,
	avg(film.length) as average_running_time
from 
	category
Inner join
	film_category
on
	category.category_id = film_category.category_id
Inner join
	film
on
	film.film_id = film_category.film_id
group by
	category.name
    
Output:
# name, average_running_time
'Action', '111.6094'
'Animation', '111.0152'
'Children', '109.8000'
'Classics', '111.6667'
'Comedy', '115.8276'
'Documentary', '108.7500'
'Drama', '120.8387'
'Family', '114.7826'
'Foreign', '121.6986'
'Games', '127.8361'
'Horror', '112.4821'
'Music', '113.6471'
'New', '111.1270'
'Sci-Fi', '108.1967'
'Sports', '128.2027'
'Travel', '113.3158'

'''

4. Which film categories are longest?

In [ ]:
'''
select 
	category.name,
	avg(film.length) as average_running_time
from 
	category
Inner join
	film_category
on
	category.category_id = film_category.category_id
Inner join
	film
on
	film.film_id = film_category.film_id
group by
	category.name
order by
	average_running_time desc
limit 
	1
    
Output:
# name, average_running_time
'Sports', '128.2027'

'''

5. Display the most frequently rented movies in descending order.

In [ ]:
'''
select 
	film.title,
    count(rental.rental_id) as rental_amount
from 
	film
Inner join
	inventory
on
	film.film_id = inventory.film_id
Inner join
	rental
on
	inventory.inventory_id = rental.inventory_id
group by
	film.title
order by
	 count(rental.rental_id) desc
     
Output:
# title, rental_amount
'BUCKET BROTHERHOOD', '34'
'ROCKETEER MOTHER', '33'
'FORWARD TEMPLE', '32'
'GRIT CLOCKWORK', '32'
'JUGGLER HARDLY', '32'
'RIDGEMONT SUBMARINE', '32'
'SCALAWAG DUCK', '32'
'APACHE DIVINE', '31'
'GOODFELLAS SALUTE', '31'
'HOBBIT ALIEN', '31'
'NETWORK PEAK', '31'
'ROBBERS JOON', '31'
....

'''

6. List the top five genres in gross revenue in descending order.

In [ ]:
'''
select 
   category.name,
   count(payment.amount) as gross_revenue
from 
	category
Inner join
	film_category
on
	category.category_id = film_category.category_id
Inner join
	film
on
	film.film_id=film_category.film_id
Inner join
	inventory
on
	film.film_id = inventory.film_id
Inner join
	rental
on
	inventory.inventory_id = rental.inventory_id
Inner join
	payment
on
	payment.rental_id = rental.rental_id
group by
	 category.name
order by
	 gross_revenue desc
limit
	5
    
    
Output:
# name, gross_revenue
'Sports', '1179'
'Animation', '1166'
'Action', '1112'
'Sci-Fi', '1101'
'Family', '1096'

'''

7. Is "Academy Dinosaur" available for rent from Store 1?

In [ ]:
'''
select 
	count(film.title) as Academy_Dinosaur_no,
    store.store_id
from 
	film
Inner join
	inventory
on
	film.film_id = inventory.film_id
Inner join
	store
on
	inventory.store_id = store.store_id
where
	film.title = "Academy Dinosaur" and store.store_id =1
group by
	store.store_id

Output:
# Academy_Dinosaur_no, store_id
'4', '1'

'''